Revit 2024 API
BuiltInFailures.GroupFailures.CannotLinkAnnotationsForSomeViews Property
 Annotations for some views cannot be displayed from linked file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotLinkAnnotationsForSomeViews { get; }
Visual Basic
Public Shared ReadOnly Property CannotLinkAnnotationsForSomeViews As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotLinkAnnotationsForSomeViews {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace